---
kind: property
id: P:Autodesk.Revit.DB.ScheduleField.FieldType
source: html/e73df1b3-d424-afe4-e1fe-dc434eadbc76.htm
---
# Autodesk.Revit.DB.ScheduleField.FieldType Property

The type of data displayed by the field.

## Syntax (C#)
```csharp
public ScheduleFieldType FieldType { get; }
```